fsi-workflow/04_fluidSimulation/solution/Fluid/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.3 0 0);

boundaryField
{
    
    //#includeEtc "caseDicts/setConstraintTypes"

    naca2312
    {
        type            noSlip;
        value           uniform (0 0 0);
    }

    far
    {
        type            slip;
    }

    inlet
    {
        type            fixedValue;
        value           $internalField;   
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }

    symmetry
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
