fsi-workflow/04_fluidSimulation/solution/Fluid/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 8;

method          scotch;
// method hierarchical;    
    
hierarchicalCoeffs
{
    n           (2 2 2);
    //delta       0.001; // default=0.001
    //order       xyz;   // default=xzy
}

// ************************************************************************* //
